/******************************************************************************

CARET
The Help File

Table of Contents:
[1] Introduction
[2] Basic Operation
[3] Special features
[4] Configuration
[5] Extending Caret

[1] -----Introduction----------------------------------------------------------

Thanks for choosing Caret as your Chrome-based text editor. This document will
provide you with a brief overview of Caret's features, shortcuts, and
configuration process. If you find parts of this documentation confusing, have
suggestions, or would like to contribute, please consider filing a support
request in the Chrome web store:

https://chrome.google.com/webstore/support/fljalecfjciodhpcledpamjachpmelml

You can also contribute directly to Caret's development through the GitHub
repository, since it is 100% open-source:

https://github.com/thomaswilburn/Caret

[2] -----Basic Operation-------------------------------------------------------

If you've used any other tabbed text editor before, Caret should appear mostly
familiar. Along the top of the screen, you'll find the application-level menus,
followed by a row of tabs for each file that's currently open. At the bottom of
the screen, there's a toolbar that will indicate the current line:column of the
cursor, as well as the current tab's syntax highlighting mode and the editor's
overall theme.

In addition to switching between tabs by clicking on them, you can also switch
tabs by pressing Ctrl-Tab and Ctrl-Shift-Tab, which will rotate through the
current list. Clicking the "x" on a tab will close it, prompting to save if the
file has been modified since you opened it.

[3] -----Special Features------------------------------------------------------

Caret supports multiple cursor mode, which can ease the process of refactoring
code or editing columnar data. To set an additional cursor with the mouse, hold
the Ctrl key, then click anywhere. You can also add a cursor above or below the
current position by pressing Ctrl-Up or Ctrl-Down. Finally, if you've selected
some text, press Ctrl-D to add the next instance of that text as an additional
selection.

You can also select text as a block of rows and columns, instead of as a series
of wrapped lines, by holding the Alt key while making a selection. The cursor
will change to a cross to indicate that you're in column selection mode. This
mode is particularly helpful when working with tab-delimited data.

There are many other special features listed in the Caret menu bar, but you
don't necessarily need to learn their keyboard shortcuts or menu position.
Instead, press Ctrl-Shift-P to open the Command Palette and begin typing. Caret
will attempt to find the command you're looking for from the menus. Press up or
down to select a command from the search list, and press Enter to execute it.

The Command Palette also has a Go To mode that can be helpful when working with
many open files. Press Ctrl-P to open the Go To window, and begin typing a
filename. Caret will list any files matching your search, and you can navigate
up or down and press Enter to jump to that file. By adding a : and a number to
your search, you can jump to a specific line within the file, or within the
current file.

[4] -----Configuration---------------------------------------------------------

As with many other features, Caret's configuration is inspired by Sublime Text
2, a wonderful editor available for Linux, Mac, and Windows (but not Chrome OS,
unfortunately). All configuration options for Caret are stored in JSON format.
Unlike Sublime, user-edited copies are not actually stored as files--they're
kept in the Chrome synchronized storage repository. The advantage of this
approach is that your preferences will be synchronized across all your
computers, including any new Caret installations.

To begin editing your config, open up Caret and click on the Settings > User
Preferences menu item. It should open up a user.json file that's a copy of the
default settings. Change "uiTheme" from "light" to "dark" and then save the
file: you should immediately see the Caret user interface flip modes. Most
settings in Caret will be updated immediately when a settings file is saved.

Although the initial configuration is a copy of the defaults, this would cause
problems when additional options were added in a new version of Caret. Behind
the scenes, your file is actually merged with the internal default settings
file. In practice, this means that you actually only need to keep the options
you have changed in your config--everything else is redundant. The internal
configuration can always be loaded, to check values or to see what's been added
by using Settings > View Defaults in the menu.

If you find that you're not happy with your configuration, you can use the
Settings > Reset submenu to clear your configuration and return it to the
default state.

[5] -----Extending Caret-------------------------------------------------------

This space intentionally left blank.

******************************************************************************/